#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.github.data.github_branch.gesassoMkMail_master will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "gesassoMkMail_master"  {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "gesasso-mkmail"
      + sha        = (known after apply)
    }

  # module.github.github_branch_default.gesassoMkMail will be created
  + resource "github_branch_default" "gesassoMkMail" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "gesasso-mkmail"
    }

  # module.github.github_branch_protection.flairsou_master will be created
  + resource "github_branch_protection" "flairsou_master" {
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "main"
      + push_restrictions      = [
          + "MDQ6VGVhbTQyMTc3MzM=",
        ]
      + repository_id          = (known after apply)
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "MDQ6VGVhbTQyMTc3MzM=",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.github.github_branch_protection.gesassoMkMail_master will be created
  + resource "github_branch_protection" "gesassoMkMail_master" {
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "master"
      + repository_id          = (known after apply)
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.github.github_project_column.flairsou_main_approved will be created
  + resource "github_project_column" "flairsou_main_approved" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "APPROVED"
      + project_id = (known after apply)
    }

  # module.github.github_project_column.flairsou_main_codeReview will be created
  + resource "github_project_column" "flairsou_main_codeReview" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "CODE REVIEW"
      + project_id = (known after apply)
    }

  # module.github.github_project_column.flairsou_main_doing will be created
  + resource "github_project_column" "flairsou_main_doing" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "DOING"
      + project_id = (known after apply)
    }

  # module.github.github_project_column.flairsou_main_done will be created
  + resource "github_project_column" "flairsou_main_done" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "DONE"
      + project_id = (known after apply)
    }

  # module.github.github_project_column.flairsou_main_todo will be created
  + resource "github_project_column" "flairsou_main_todo" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "TODO"
      + project_id = (known after apply)
    }

  # module.github.github_repository.flairsou will be created
  + resource "github_repository" "flairsou" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Outil de tresorerie associative"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "flairsou"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github.github_repository.gesassoMkMail will be created
  + resource "github_repository" "gesassoMkMail" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Le nécessaire pour les mails"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "gesasso-mkmail"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "gesasso",
          + "infra",
        ]
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github.github_repository_project.flairsou_main will be created
  + resource "github_repository_project" "flairsou_main" {
      + body       = "Main project's tasks"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "Flairsou Main Project"
      + repository = "flairsou"
      + url        = (known after apply)
    }

  # module.github.github_team.gesasso will be created
  + resource "github_team" "gesasso" {
      + description = "L'outil de gestion des assos au SiMDE"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Gesasso"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # module.github.github_team.gesasso_old will be created
  + resource "github_team" "gesasso_old" {
      + description = "Développer le gestionnaire des associations"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "gesasso_old"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # module.github.github_team_repository.flairsou will be created
  + resource "github_team_repository" "flairsou" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "flairsou"
      + team_id    = "4276153"
    }

  # module.github.github_team_repository.gesasso_gesasso2 will be destroyed
  - resource "github_team_repository" "gesasso_gesasso2" {
      - etag       = "W/\"02f0dc0a8a70aa2ef04168a9d40c38ed6b27ebec1d6d962c0744392b59e4dc38\"" -> null
      - id         = "3158197:gesasso2" -> null
      - permission = "push" -> null
      - repository = "gesasso2" -> null
      - team_id    = "3158197" -> null
    }

  # module.github.github_team_repository.gesasso_mkmail will be created
  + resource "github_team_repository" "gesasso_mkmail" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "gesasso-mkmail"
      + team_id    = (known after apply)
    }

  # module.github.github_team_repository.gesasso_old_gesasso2 will be created
  + resource "github_team_repository" "gesasso_old_gesasso2" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "gesasso2"
      + team_id    = (known after apply)
    }

  # module.github.github_team_repository.simde_flairsou will be created
  + resource "github_team_repository" "simde_flairsou" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "flairsou"
      + team_id    = "4217733"
    }

  # module.discord_simde.module.theo_chazeaud.discord_member_roles.member_role["776093666267758604"] will be destroyed
  - resource "discord_member_roles" "member_role" {
      - id        = "512477527" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "776179622734856263" -> null

      - role {
          - has_role = true -> null
          - role_id  = "776093666267758604" -> null
        }
    }

  # module.github.module.cesar-richard.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "cesar-richard"
    }

  # module.github.module.cesar-richard.github_team_membership.membership["jeffrey"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4211302"
      + username = "cesar-richard"
    }

  # module.github.module.cesar-richard.github_team_membership.membership["simde"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4217733"
      + username = "cesar-richard"
    }

  # module.github.module.cesar_richard.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"cab17753b6aca5ca4d3c246d56d73f3f8f2bfca8c92b48451be8997f5ae8ff7d\"" -> null
      - id       = "SiMDE-Projects:cesar-richard" -> null
      - role     = "admin" -> null
      - username = "cesar-richard" -> null
    }

  # module.github.module.cesar_richard.github_team_membership.membership["jeffrey"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"8a88045552b3cb1ebd2a9f58abc1b83e6bc366a590208146fd8244612162544c\"" -> null
      - id       = "4211302:cesar-richard" -> null
      - role     = "maintainer" -> null
      - team_id  = "4211302" -> null
      - username = "cesar-richard" -> null
    }

  # module.github.module.cesar_richard.github_team_membership.membership["simde"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"0d1f9a25dbc9651da774d65342ddaef3ca360c36b1ca5e9637637e8f87b7dbcb\"" -> null
      - id       = "4217733:cesar-richard" -> null
      - role     = "maintainer" -> null
      - team_id  = "4217733" -> null
      - username = "cesar-richard" -> null
    }

  # module.github.module.huetremy.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "huetremy"
    }

  # module.github.module.huetremy.github_team_membership.membership["flairsou"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4276153"
      + username = "huetremy"
    }

  # module.github.module.matthieu_decaux.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"603f97784a9266ab45dc877c0d3e81c77f4632a6ffa571c5285bdd58d6d589a2\"" -> null
      - id       = "SiMDE-Projects:matthieudecaux" -> null
      - role     = "member" -> null
      - username = "matthieudecaux" -> null
    }

  # module.github.module.matthieu_decaux.github_team_membership.membership["flairsou"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"3e13ec4b2c5c977d18d648db135c137b4324cfc6e203f47761f1fa7e6f8175ed\"" -> null
      - id       = "4276153:matthieudecaux" -> null
      - role     = "member" -> null
      - team_id  = "4276153" -> null
      - username = "matthieudecaux" -> null
    }

  # module.github.module.matthieudecaux.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "matthieudecaux"
    }

  # module.github.module.matthieudecaux.github_team_membership.membership["flairsou"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "4276153"
      + username = "matthieudecaux"
    }

  # module.github.module.maxime-vaillant.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "maxime-vaillant"
    }

  # module.github.module.maxime-vaillant.github_team_membership.membership["jeffrey"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "4211302"
      + username = "maxime-vaillant"
    }

  # module.github.module.maxime_vaillant.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"c335199b40456a84b5990b594c8fc7d3a0e37c7acd00acf7273d6d77aa94ea53\"" -> null
      - id       = "SiMDE-Projects:maxime-vaillant" -> null
      - role     = "member" -> null
      - username = "maxime-vaillant" -> null
    }

  # module.github.module.maxime_vaillant.github_team_membership.membership["jeffrey"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"9dfb2a898ff5939ca2fc68d180a11044553b9eb1b172ee76c4728e5a848c03c1\"" -> null
      - id       = "4211302:maxime-vaillant" -> null
      - role     = "member" -> null
      - team_id  = "4211302" -> null
      - username = "maxime-vaillant" -> null
    }

  # module.github.module.noe_amiot.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"452ced5237d0b855c493dccd53d4cf4174706422f383f56b811b9601b17ba5a6\"" -> null
      - id       = "SiMDE-Projects:noeamiot" -> null
      - role     = "admin" -> null
      - username = "noeamiot" -> null
    }

  # module.github.module.noe_amiot.github_team_membership.membership["jeffrey"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"1bbd573955c51b340d36285d42baa8e6c21b30b8635b042775a32b469f03be31\"" -> null
      - id       = "4211302:noeamiot" -> null
      - role     = "member" -> null
      - team_id  = "4211302" -> null
      - username = "noeamiot" -> null
    }

  # module.github.module.noe_amiot.github_team_membership.membership["simde"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"e5eb1c400263a4c62b218457ca447684752adf619ace21eda08bf490f3d7b50c\"" -> null
      - id       = "4217733:noeamiot" -> null
      - role     = "maintainer" -> null
      - team_id  = "4217733" -> null
      - username = "noeamiot" -> null
    }

  # module.github.module.noeamiot.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "noeamiot"
    }

  # module.github.module.noeamiot.github_team_membership.membership["jeffrey"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "4211302"
      + username = "noeamiot"
    }

  # module.github.module.noeamiot.github_team_membership.membership["simde"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "4217733"
      + username = "noeamiot"
    }

  # module.github.module.old_Cathaiste.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "Cathaiste"
    }

  # module.github.module.old_Cathaiste.github_team_membership.membership["locky"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3644328"
      + username = "Cathaiste"
    }

  # module.github.module.old_Cathaiste.github_team_membership.membership["portail"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158212"
      + username = "Cathaiste"
    }

  # module.github.module.old_Cathaiste.github_team_membership.membership["woolly"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158208"
      + username = "Cathaiste"
    }

  # module.github.module.old_NastuzziSamy.github_team_membership.membership["gesasso"] must be replaced
-/+ resource "github_team_membership" "membership" {
      ~ etag     = "W/\"9d9950e748f8ce8989b12df3e7a5cd5d832efe5d9e0db564463bc94e77b4f29e\"" -> (known after apply)
      ~ id       = "3158197:NastuzziSamy" -> (known after apply)
      ~ team_id  = "3158197" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.github.module.old_abrasseu.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "abrasseu"
    }

  # module.github.module.old_abrasseu.github_team_membership.membership["payutc"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158200"
      + username = "abrasseu"
    }

  # module.github.module.old_abrasseu.github_team_membership.membership["woolly"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158208"
      + username = "abrasseu"
    }

  # module.github.module.old_alexandre_brasseur.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"86c65354ac359d827afc5f2498575b10c18f17dee0a3040f8475164297ce6360\"" -> null
      - id       = "simde-utc:abrasseu" -> null
      - role     = "member" -> null
      - username = "abrasseu" -> null
    }

  # module.github.module.old_alexandre_brasseur.github_team_membership.membership["payutc"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"9b2f5d9dfa883f45632332618e67829368ad6dcdf39e5a95678067429b57f1fe\"" -> null
      - id       = "3158200:abrasseu" -> null
      - role     = "member" -> null
      - team_id  = "3158200" -> null
      - username = "abrasseu" -> null
    }

  # module.github.module.old_alexandre_brasseur.github_team_membership.membership["woolly"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"007cce4e2ebeae776160a494fc9c487db6492eec3e2dc53618955dfb3ebe71e7\"" -> null
      - id       = "3158208:abrasseu" -> null
      - role     = "member" -> null
      - team_id  = "3158208" -> null
      - username = "abrasseu" -> null
    }

  # module.github.module.old_bonnetst.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "bonnetst"
    }

  # module.github.module.old_cesar-richard.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "cesar-richard"
    }

  # module.github.module.old_cesar-richard.github_team_membership.membership["gesasso"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "cesar-richard"
    }

  # module.github.module.old_cesar-richard.github_team_membership.membership["locky"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "3644328"
      + username = "cesar-richard"
    }

  # module.github.module.old_cesar-richard.github_team_membership.membership["payutc"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "3158200"
      + username = "cesar-richard"
    }

  # module.github.module.old_cesar_richard.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"a0d854074643c93af51a6ce479a2a8996b8877f9cd1d28b02a6ad461b4be19ea\"" -> null
      - id       = "simde-utc:cesar-richard" -> null
      - role     = "admin" -> null
      - username = "cesar-richard" -> null
    }

  # module.github.module.old_cesar_richard.github_team_membership.membership["gesasso"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"0c620fcb365f5cea25b5dd3e6293eef7a496f54572ba3f6c9b2a3d50b759db8f\"" -> null
      - id       = "3158197:cesar-richard" -> null
      - role     = "maintainer" -> null
      - team_id  = "3158197" -> null
      - username = "cesar-richard" -> null
    }

  # module.github.module.old_cesar_richard.github_team_membership.membership["locky"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"6c1cfcd7ff1d4f4bf059a163a8a1735fe7e4336c01056c7020c33bd539133b3f\"" -> null
      - id       = "3644328:cesar-richard" -> null
      - role     = "maintainer" -> null
      - team_id  = "3644328" -> null
      - username = "cesar-richard" -> null
    }

  # module.github.module.old_cesar_richard.github_team_membership.membership["payutc"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"ad9d286564510835650930104f0c1210f8aa5149b7ba9b1669a264a3bf36a60b\"" -> null
      - id       = "3158200:cesar-richard" -> null
      - role     = "maintainer" -> null
      - team_id  = "3158200" -> null
      - username = "cesar-richard" -> null
    }

  # module.github.module.old_colin_lafond.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"e4ef5e5b8f7912ae80b0a0c9c68b11cb1b931dca6be1ac2d7baa33d26956a725\"" -> null
      - id       = "simde-utc:lafondoc" -> null
      - role     = "member" -> null
      - username = "lafondoc" -> null
    }

  # module.github.module.old_colin_lafond.github_team_membership.membership["payutc"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"1d10d8499d2942249eecf167f60f0ae03111e44085ceb0a632ae60cbb57a2d19\"" -> null
      - id       = "3158200:lafondoc" -> null
      - role     = "member" -> null
      - team_id  = "3158200" -> null
      - username = "lafondoc" -> null
    }

  # module.github.module.old_jumelloic.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "jumelloic"
    }

  # module.github.module.old_jumelloic.github_team_membership.membership["gesasso"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "jumelloic"
    }

  # module.github.module.old_lafondoc.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "lafondoc"
    }

  # module.github.module.old_lafondoc.github_team_membership.membership["payutc"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158200"
      + username = "lafondoc"
    }

  # module.github.module.old_loic_jumel.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"460e16f58c3167304d0966e39d065625d6e2f5feb92ebcd1e35e8187e039c10c\"" -> null
      - id       = "simde-utc:jumelloic" -> null
      - role     = "member" -> null
      - username = "jumelloic" -> null
    }

  # module.github.module.old_loic_jumel.github_team_membership.membership["gesasso"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"a65fd60a6e7d0c5fa0b55f3916aa53bcfe0ff32e1fb445114b56f9ce059951d4\"" -> null
      - id       = "3158197:jumelloic" -> null
      - role     = "member" -> null
      - team_id  = "3158197" -> null
      - username = "jumelloic" -> null
    }

  # module.github.module.old_luc_varoqui.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"963760c3645953b8071a314d5daa04ef904051fe9ad7b190a290aa3e07f973f9\"" -> null
      - id       = "simde-utc:lvaroqui" -> null
      - role     = "member" -> null
      - username = "lvaroqui" -> null
    }

  # module.github.module.old_luc_varoqui.github_team_membership.membership["portail"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"ad1fb7d191938f5e80543d224e40145d39c7e46b4e91cc64ffebdf74f4891491\"" -> null
      - id       = "3158212:lvaroqui" -> null
      - role     = "member" -> null
      - team_id  = "3158212" -> null
      - username = "lvaroqui" -> null
    }

  # module.github.module.old_luc_varoqui.github_team_membership.membership["woolly"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"e6eb385c252e7fb688b9b1cd82d33d17507d7e0627a4e94eb78fef0231d7711d\"" -> null
      - id       = "3158208:lvaroqui" -> null
      - role     = "member" -> null
      - team_id  = "3158208" -> null
      - username = "lvaroqui" -> null
    }

  # module.github.module.old_lvaroqui.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "lvaroqui"
    }

  # module.github.module.old_lvaroqui.github_team_membership.membership["portail"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158212"
      + username = "lvaroqui"
    }

  # module.github.module.old_lvaroqui.github_team_membership.membership["woolly"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158208"
      + username = "lvaroqui"
    }

  # module.github.module.old_stephane_bonnet.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"afbff9d6b251649f9e900b34398d9c59be126dadde2d7b0efe326f10ec2bb459\"" -> null
      - id       = "simde-utc:bonnetst" -> null
      - role     = "member" -> null
      - username = "bonnetst" -> null
    }

  # module.github.module.old_victor_ronfaut.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"c9f314ce12b65ff296a39070aae6acd543d9d6f9b6957d98884b9366b89d4998\"" -> null
      - id       = "simde-utc:Cathaiste" -> null
      - role     = "member" -> null
      - username = "Cathaiste" -> null
    }

  # module.github.module.old_victor_ronfaut.github_team_membership.membership["locky"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"e38298a9637b1893ad4908af8d58b68eceb1a34d5d4f7f2c5eecf0f0d48dc77b\"" -> null
      - id       = "3644328:Cathaiste" -> null
      - role     = "member" -> null
      - team_id  = "3644328" -> null
      - username = "Cathaiste" -> null
    }

  # module.github.module.old_victor_ronfaut.github_team_membership.membership["portail"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"abc6f1ad727212d6bf9e28a820c155026fb3146460c4f79559b43ff93cd4241b\"" -> null
      - id       = "3158212:Cathaiste" -> null
      - role     = "member" -> null
      - team_id  = "3158212" -> null
      - username = "Cathaiste" -> null
    }

  # module.github.module.old_victor_ronfaut.github_team_membership.membership["woolly"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"1f360f478f1057d166f7674b8b3fe8a80af7512d0d688de1d08319104bfc6772\"" -> null
      - id       = "3158208:Cathaiste" -> null
      - role     = "member" -> null
      - team_id  = "3158208" -> null
      - username = "Cathaiste" -> null
    }

  # module.github.module.remy_huet.github_membership.membership will be destroyed
  - resource "github_membership" "membership" {
      - etag     = "W/\"c0f5ca542f546071c966e75320e97e05471e30cae21291c0fa62da61037b64b8\"" -> null
      - id       = "SiMDE-Projects:huetremy" -> null
      - role     = "member" -> null
      - username = "huetremy" -> null
    }

  # module.github.module.remy_huet.github_team_membership.membership["flairsou"] will be destroyed
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"4d7514453ac3e93784eba3172296768539659bb81ab8a5913bbd1e08fe8ff857\"" -> null
      - id       = "4276153:huetremy" -> null
      - role     = "maintainer" -> null
      - team_id  = "4276153" -> null
      - username = "huetremy" -> null
    }

  # module.github.module.repositories.github_branch_protection.flairsou_master will be destroyed
  - resource "github_branch_protection" "flairsou_master" {
      - enforce_admins         = false -> null
      - id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgzMTcwMDE=" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [
          - "MDQ6VGVhbTQyMTc3MzM=",
        ] -> null
      - repository_id          = "MDEwOlJlcG9zaXRvcnkzMTMwNzk1OTY=" -> null
      - require_signed_commits = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [
              - "MDQ6VGVhbTQyMTc3MzM=",
            ] -> null
          - require_code_owner_reviews      = true -> null
          - required_approving_review_count = 1 -> null
        }
    }

  # module.github.module.repositories.github_project_column.flairsou_main_approved will be destroyed
  - resource "github_project_column" "flairsou_main_approved" {
      - column_id  = 11726488 -> null
      - id         = "11726488" -> null
      - name       = "APPROVED" -> null
      - project_id = "5920244" -> null
    }

  # module.github.module.repositories.github_project_column.flairsou_main_codeReview will be destroyed
  - resource "github_project_column" "flairsou_main_codeReview" {
      - column_id  = 11726486 -> null
      - id         = "11726486" -> null
      - name       = "CODE REVIEW" -> null
      - project_id = "5920244" -> null
    }

  # module.github.module.repositories.github_project_column.flairsou_main_doing will be destroyed
  - resource "github_project_column" "flairsou_main_doing" {
      - column_id  = 11726485 -> null
      - id         = "11726485" -> null
      - name       = "DOING" -> null
      - project_id = "5920244" -> null
    }

  # module.github.module.repositories.github_project_column.flairsou_main_done will be destroyed
  - resource "github_project_column" "flairsou_main_done" {
      - column_id  = 11726484 -> null
      - id         = "11726484" -> null
      - name       = "DONE" -> null
      - project_id = "5920244" -> null
    }

  # module.github.module.repositories.github_project_column.flairsou_main_todo will be destroyed
  - resource "github_project_column" "flairsou_main_todo" {
      - column_id  = 11726487 -> null
      - id         = "11726487" -> null
      - name       = "TODO" -> null
      - project_id = "5920244" -> null
    }

  # module.github.module.repositories.github_repository.flairsou will be destroyed
  - resource "github_repository" "flairsou" {
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Outil de tresorerie associative" -> null
      - etag                   = "W/\"6a4d95ed0050d404fc173aea232a9f6fe25810ee58d5e1b2b26f4deaee8cc3e3\"" -> null
      - full_name              = "SiMDE-Projects/flairsou" -> null
      - git_clone_url          = "git://github.com/SiMDE-Projects/flairsou.git" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = true -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/SiMDE-Projects/flairsou" -> null
      - http_clone_url         = "https://github.com/SiMDE-Projects/flairsou.git" -> null
      - id                     = "flairsou" -> null
      - is_template            = false -> null
      - name                   = "flairsou" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnkzMTMwNzk1OTY=" -> null
      - private                = false -> null
      - repo_id                = 313079596 -> null
      - ssh_clone_url          = "git@github.com:SiMDE-Projects/flairsou.git" -> null
      - svn_url                = "https://github.com/SiMDE-Projects/flairsou" -> null
      - topics                 = [] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.github.module.repositories.github_repository_project.flairsou_main will be destroyed
  - resource "github_repository_project" "flairsou_main" {
      - body       = "Main project's tasks" -> null
      - etag       = "W/\"54a91eaf56f5a9dedfd63c4c52cc0537527dfcf5552c5d4d5d23876fa3388e0b\"" -> null
      - id         = "5920244" -> null
      - name       = "Flairsou Main Project" -> null
      - repository = "flairsou" -> null
      - url        = "https://github.com/SiMDE-Projects/flairsou/projects/2" -> null
    }

  # module.github.module.repositories.github_team_repository.flairsou_flairsou will be destroyed
  - resource "github_team_repository" "flairsou_flairsou" {
      - etag       = "W/\"e64c5c27007b7d511db44ec953f1b0195754cfe62884feb3c7df76361c9ee8d7\"" -> null
      - id         = "4276153:flairsou" -> null
      - permission = "maintain" -> null
      - repository = "flairsou" -> null
      - team_id    = "4276153" -> null
    }

  # module.github.module.repositories.github_team_repository.simde_flairsou will be destroyed
  - resource "github_team_repository" "simde_flairsou" {
      - etag       = "W/\"e64c5c27007b7d511db44ec953f1b0195754cfe62884feb3c7df76361c9ee8d7\"" -> null
      - id         = "4217733:flairsou" -> null
      - permission = "maintain" -> null
      - repository = "flairsou" -> null
      - team_id    = "4217733" -> null
    }

Plan: 49 to add, 0 to change, 44 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @noeamiot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*